bin/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
    - post:
        url: "/api/auth/login"
        json:
          username: "admin"
          password: "admin123"
    - get:
        url: "/api/actions"
        headers:
          Authorization: "Bearer {{ token }}"